CSI API ETABS v1

# cConstraintGetDiaphragm Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetDiaphragm(
    	string Name,
    	ref eConstraintAxis Axis,
    	ref string CSys
    )

    Function GetDiaphragm (
    	Name As String,
    	ByRef Axis As eConstraintAxis,
    	ByRef CSys As String
    ) As Integer

    Dim instance As cConstraint
    Dim Name As String
    Dim Axis As eConstraintAxis
    Dim CSys As String
    Dim returnValue As Integer

    returnValue = instance.GetDiaphragm(Name,
    	Axis, CSys)

    int GetDiaphragm(
    	String^ Name,
    	eConstraintAxis% Axis,
    	String^% CSys
    )

    abstract GetDiaphragm :
            Name : string *
            Axis : eConstraintAxis byref *
            CSys : string byref -> int

#### Parameters

Name

    Type: SystemString

Axis

    Type: ETABSv1eConstraintAxis

CSys

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cConstraint Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com